randread/96_node/job_1470999_fiojob_4/nid00132_fiojob_4/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 4 processes
rand-read: Laying out IO file (1 file / 1024MiB)
rand-read: Laying out IO file (1 file / 1024MiB)

test: (groupid=0, jobs=4): err= 0: pid=129800: Tue Jul 20 10:17:11 2021
  read: IOPS=533, BW=2135KiB/s (2186kB/s)(625MiB/300011msec)
    slat (usec): min=460, max=102414, avg=7471.72, stdev=5047.36
    clat (usec): min=17, max=2299.5k, avg=1905354.68, stdev=123947.86
     lat (msec): min=5, max=2304, avg=1912.83, stdev=124.08
    clat percentiles (msec):
     |  1.00th=[ 1703],  5.00th=[ 1770], 10.00th=[ 1804], 20.00th=[ 1838],
     | 30.00th=[ 1854], 40.00th=[ 1888], 50.00th=[ 1905], 60.00th=[ 1938],
     | 70.00th=[ 1955], 80.00th=[ 1989], 90.00th=[ 2022], 95.00th=[ 2056],
     | 99.00th=[ 2123], 99.50th=[ 2165], 99.90th=[ 2232], 99.95th=[ 2265],
     | 99.99th=[ 2299]
   bw (  KiB/s): min=  544, max= 2704, per=99.92%, avg=2133.08, stdev=47.93, samples=2384
   iops        : min=  136, max=  676, avg=533.26, stdev=11.98, samples=2384
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%, 250=0.06%
  lat (msec)   : 500=0.07%, 750=0.08%, 1000=0.08%, 2000=84.93%, >=2000=14.73%
  cpu          : usr=0.36%, sys=2.30%, ctx=160143, majf=0, minf=1181
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=160103,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=2135KiB/s (2186kB/s), 2135KiB/s-2135KiB/s (2186kB/s-2186kB/s), io=625MiB (656MB), run=300011-300011msec